import '../core/image_root.dart';

class AboutUsModel {
  String? title;
  String? img;
  String? body;

  AboutUsModel({this.title, this.img, this.body});
}

List<AboutUsModel> aboutUsModeList = [
  AboutUsModel(
      title:
          'لقد ساعد ديفا العديد من النساء أن يتألقوا في اللحظات الخاصة في حياتهم، فنحن نريد أن نجعلك مذهلة في يومك. حيث أننا نقدم لكِ أكبر تشكيلة فساتين، كما نقدم لكِ مجموعة واسعة من الإستايلات، المقاسات، والألوان المختلفة بأسعار معقولة حتى تتمكني من الحصول على فستان أحلامك. كما أننا نقدم لكِ خدمة ” الميك أب أستوديو ” بادارة ميك اب ارتيس'),
  AboutUsModel(
      title:
          'مدام ديفا والتي تقوم بعمل ميك اب العرايس وفورمة الشعر لكي تطل باطلالة مميزة في يوم الزفاف '),
];
List<AboutUsModel> aboutUsModeListTwo = [
  AboutUsModel(
      img: ImageRoot.aboutUsImgOne,
      title: 'قسم خاص بفساتين الزفاف',
      body:
          'موجود في ديفا فريق متخصص واقف معاكي يساعدك على إختيار الفستان المناسب لجسمك وشكلك ولون بشرتك عشان تقدري تتجنبي ظهور أي ديفوهات وتطلعي ملكة في ليلة العمر. متوفر في ديفا فساتين زفاف للمحجبات وغير المحجبات وفساتين زفاف بذيل وذيل متوسط أو بدون ديل. كل فساتين الزفاف في ديفا مستوردة. متوفر في ديفا فساتين زفاف لأشهر مصممي الأزياء.'),
  AboutUsModel(
      img: ImageRoot.aboutUsImgTwo,
      title: 'برنامج تنظيف البشرة و الشعر',
      body:
          'موجود في ديفا فريق متخصص واقف معاكي يساعدك على إختيار الفستان المناسب لجسمك وشكلك ولون بشرتك عشان تقدري تتجنبي ظهور أي ديفوهات وتطلعي ملكة في ليلة العمر. متوفر في ديفا فساتين زفاف للمحجبات وغير المحجبات وفساتين زفاف بذيل وذيل متوسط أو بدون ديل. كل فساتين الزفاف في ديفا مستوردة. متوفر في ديفا فساتين زفاف لأشهر مصممي الأزياء.'),
];
